vcr_cassettes/create_charge_with_valid_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=300&currency=usd&card=tok_14Iq7D4P9PjYyYg2zkCa5AeM
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - Bearer pk_test_4RJyeK2OO0YGftkt2tcCCtG3
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        joshua-leemans-computer.local 13.3.0 Darwin Kernel Version 13.3.0: Tue Jun  3
        21:27:35 PDT 2014; root:xnu-2422.110.17~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '57'
  response:
    status:
      code: 401
      message: Unauthorized
    headers:
      Server:
      - nginx
      Date:
      - Mon, 21 Jul 2014 23:22:43 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '247'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Stripe-Version:
      - '2014-06-17'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Www-Authenticate:
      - Basic realm="Stripe"
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "type": "invalid_request_error",
            "message": "This API call cannot be made with a publishable API key. Please use a secret API key. You can find a list of your API keys at https://dashboard.stripe.com/account/apikeys."
          }
        }
    http_version: 
  recorded_at: Mon, 21 Jul 2014 23:22:44 GMT
recorded_with: VCR 2.9.2
